//5. Написать программу вычисления значения функции y=f(a)/ y=ka+m
int F(int a, int k, int m)
{
    return k * a + m;
}
Console.WriteLine(F(5, 2, 7));