//Вывести на экран английский алфавит
char glif = 'a';
while (glif <= 'z')
{
    Console.Write(glif + " ");
    glif++;
}
